export const Character = [
    {   
        id: 1,
        img: require('../image/Luffy.jpg'),
        pic: require('../image/Pic/Luffy_1.png') ,
        ชื่อ: "มังกี้ ดี ลูฟี่ (モンキー・D・ルフィ Monkey D. Luffy)",
        ค่าหัว: "1,500,000,000 เบรี",
        ตำแหน่ง: "กัปตันกลุ่มโจรสลัดหมวกฟาง",
        ความสามารถ: "มีความสามารถในการใช้ร่างกายที่เป็นยางในการเป่าลมเข้าไปจนเหมือนเป็นลูกโป่งเพื่อช่วยในการรับและโจมตีศัตรูด้วยร่างกายขนาดยักษ์",
        ผลปิศาจ:  "ผล โกมุ โกมุ สายพารามีเซีย ผลยาง" ,
        ฉายา: "หมวกฟาง ลูฟี่",
        ความเป็นมา: "ใฝ่ฝันอยากเป็นเจ้าแห่งโจรสลัด ตอนเด็กได้รู้จักกับแชงคูลจึงอยากเป็นโจรสลัดเมือนแชงคูล ได้กินเหล้าร่วมสาบานกับเอสเพื่อเป็นพี่น้องกัน พลังความมุ่งมั่นสูง เมื่อตั้งใจแล้วต้องทำให้ได้ และพึ่งพาได้ รักเพื่อนพ้องที่สุด ซึ่งไม่ว่าจะเป็นยังไง ก็จะต้องช่วยเพื่อนไว้ให้ได้ (ได้กินผลโกมุโกมุ (พารามิเซีย) หรือผลยางยืดเข้าไป ทำให้ร่างกายยืนหยุ่นได้เหมือนยาง ถึงแม้ความสามารถไม่โดดเด่นแต่สามารถนำทักษะมาร่วมกับพลังใจที่มุ่งมั่นและความสามารถ ทำให้ดึงพลังในการต่อสู้ได้สูงมาก) ค่าหัวล่าสุดหลังจากเหตุการณ์ที่เกาะเอนิเอสลอบบี้คือ 300 ล้านเบรีได้รับฉายาว่า 'หมวกฟางลูฟี่' เมื่อ 2 ปีต่อมาหลังจากที่เขาไปก่อเรื่องที่ศูนย์บัญชาการใหญ่กองทัพเรือทำให้เขามีค่าหัวสูงถึง 400 ล้าน"
    },
    {
        id: 2,
        img: require('../image/Solo.jpg'),
        pic: require('../image/Pic/Luffy_1.png') ,
        ชื่อ: "โรโรโนอา โซโล (ロロノア・ゾロ Roronoa zoro)",
        ค่าหัว: "320,000,000 เบรี",
        ตำแหน่ง: "นักดาบประจำเรือกลุ่มโจรสลัดหมวกฟาง",
        ความสามารถ: "หลงทาง",
        ผลปิศาจ: "ไม่มี",
        ฉายา: "นักล่าโจรสลัด โรโรโนอา โซโล",
        ความเป็นมา: "นักดาบผู้ใช้วิชา 3 ดาบ เป็นสมาชิกคนแรกของกลุ่มโจรสลัดหมวกฟาง เคยเป็นนักล่าโจรสลัดมาก่อนที่จะร่วมกับลูฟี่ เป็นคู่กัดกับชันจิ มีความใฝ่ฝันอยากเป็นนักดาบอันดับหนึ่งของโลก เป็นคนจริงจัง เข้มแข็ง และแข็งแกร่งมากภายในกลุ่ม แต่ก็เป็นคนที่ชอบนอนหลับ, หลงทางและดื่มเหล้าที่สุด ค่าหัวล่าสุด 120 ล้านเบรี ได้รับฉายาว่า 'นักล่าโจรสลัด โซโล' และ 2ปีที่หายไปเขาได้ไปฝึกกับ ชายตาเหยี่ยว และตาข้างซ้ายของโซโลบอด"

    },

    {
        id: 3,
        img: require('../image/Nami.png'),
        pic: require('../image/Pic/Luffy_1.png') ,
        ชื่อ: "นามิ (ナミ NAMI)",
        ค่าหัว: "66,000,000 เบรี",
        ตำแหน่ง: "ต้นหนประจำกลุ่มโจรสลัดหมวกฟาง",
        ความสามารถ: "-",
        ผลปิศาจ: "ไม่มี",
        ฉายา: "แมวขโมย",
        ความเป็นมา: "สาวต้นหนประจำเรือที่มีพรสวรรค์ในการอ่านแผนที่ ก่อนจะมาอยู่กับลูฟี่ นามิทำงานให้กับกลุ่มโจรสลัดเงือก กลุ่มโจลสลัดเงือก อารอง โดยถูกหลอกให้หาเงินและเขียนแผนที่ เพื่อที่ปกป้องหมู่บ้านของตนไว้จากการปกครองแบบเผด็จการและข่มขู่ ได้ลูฟี่ช่วยเหลือและชักชวนมาเข้ากลุ่ม อุซปเป็นผู้ประดิษฐ์อาวุธให้โดยตอนแรกจะสร้างไว้เพื่อแสดงในงานเลี้ยง แต่ภายหลังได้ไดอัลมาจากเกาะแห่งท้องฟ้า อุซปจึงพัฒนาอาวุธนี้ ให้ก้าวหน้าและนำมาใช้โดยเวลาต่อสู้นามิจะสามารถสร้าง และควบคุมสภาพอากาศได้ และดึงพลังทางธรรมชาติออกมาใช้ได้อย่างคล่องแคล่ว มีความใฝ่ฝันคือเขียนแผนที่รอบโลก มีค่าหัว 16 ล้านเบรี ได้รับฉายาว่า 'แมวขโมย นามิ' "

    },

    {
        id:4,
        img: require('../image/Usob.jpg'),
        pic: require('../image/Pic/Luffy_1.png') ,
        ชื่อ: "อุซป (ウソップ Usopp)",
        ค่าหัว: "200,000,000 เบรี",
        ตำแหน่ง: "พลปืนประจำกลุ่มโจรสลัดหมวกฟาง",
        ความสามารถ: "-",
        ผลปิศาจ: "ไม่มี",
        ฉายา: "จ้าวแห่งการซุ่มยิง",
        ความเป็นมา: "นักแม่นปืนประจำเรือ ฝีมือยิงปืนสูงพอๆกับฝีมือการโกหก มีนิสัยขี้ขลาด แต่เมื่อใดที่เพื่อนโดนดูถูกหรือต้องการความช่วยเหลือ เขาก็ยินดีเอาชีวิตเข้าเสี่ยง พ่อของอุซบชื่อ 'ยาซบ'เป็นลูกเรือของกลุ่มโจรสลัดแชงคูล'ผมแดง'ที่เมืองวอเตอร์เซเว่นอุซปได้ทะเลาะกับลูฟีเรื่องการซื้อเรือใหม่แต่อุซปไม่เห็นด้วยจึงขอแยกออกจากกลุ่ม แต่ตอนหลังได้กลับมาช่วยลูฟี่ จึงใส่หน้ากากปลอมตัว (ในนามของโซเงคิง) ค่าหัว30 ล้านเบรี ได้รับฉายาว่า 'เจ้าแห่งการซุ่มยิง โซเงคิง'"
    },

    {
        id: 5,
        img: require('../image/Sunji.jpg'),
        pic: require('../image/Pic/Luffy_1.png') ,
        ชื่อ: "ซันจิ (サンジ Sanji)",
        ค่าหัว: "330,000,000 เบรี",
        ตำแหน่ง: "พ่อครัวประจำกลุ่มโจรสลัดหมวกฟาง",
        ความสามารถ: "-",
        ผลปิศาจ: "ไม่มี",
        ฉายา: "ขาดำซันจิ",
        ความเป็นมา: "ลักษณะเป็นชายผมเหลืองด้านหน้ายาวจนปิดตาข้างซ้ายและคิ้วข้างขวาหมุนเป็นไม้ม้วนไปทางขวา 2 ปี ต่อมาเปลี่ยนไปปิดตาขวาและคิ้วข้างซ้ายหมุนเป็นไม้ม้วนไปทางขวา ใช้ขาทั้งสองในการต่อสู้ ไม่นิยมใช้มือต่อสู้เพราะถือว่า ใช้มือในการปรุงอาหารเท่านั้น เกลียดพวกที่เอาอาหารมาเล่นและพวกที่ดูถูกอาหาร โดยใช้ท่าในการต่อสู้จากเพลงเตะ แทบทั้งสิ้น โดยชื่อท่าจะดัดแปลงมาจากชื่ออาหาร มีความใฝ่ฝันในการตามหาออลบลู นิสัยชอบหลีสาวๆหน้าตาดี โดยเฉพาะนามิ และโรบิน (มีคติจะไม่เตะผู้หญิงแม้ต้องถูกฆ่าตาย) ค่าหัว 77 ล้านเบรี ได้รับฉายาว่า 'ขาดำ ซันจิ'(รูปบนใบค่าหัวนั้นเป็นเพียงรูปสเก็ตเนื่องจากทางทหารเรือไม่สามารถเก็บภาพของซันจิได้เพราะช่างภาพของทหารเรือที่แอบถ่ายรูปนั้นตอนถ่ายลืมเปิดฝาของกล้องถ่ายรูป ทำให้ไม่สามารถถ่ายภาพได้)"
    },

    {
        id: 6,
        img: require('../image/Shopper.jpeg'),
        pic: require('../image/Pic/Luffy_1.png') ,
        ชื่อ: "โทนี่ โทนี่ ช็อปเปอร์ (ニートニー・チョッパー Tony Tony Chopper)",
        ค่าหัว: "100 เบรี",
        ตำแหน่ง: "หมอประจำกลุ่มโจรสลัดหมวกฟาง",
        ความสามารถ: "-",
        ผลปิศาจ: "ผล ฮิโตะ ฮิโตะ สายโซออน ผลมนุษย์ ทำให้สัตว์เป็นมนุษย์",
        ฉายา: "เรนเดียร์จมูกน้ำเงิน",
        ความเป็นมา: "ใฝ่ฝันที่จะเป็นหมอที่สามารถรักษาได้ทุกโรค ในอดีตนั้นเป็นกวางเรนเดียร์จมูกน้ำเงิน แต่ได้กินผลฮิโตะฮิโตะ (ผลมนุษย์) เข้าไปทำให้สามารถแปลงกายเป็นมนุษย์ (แต่ไม่ค่อยเหมือน) ทั้งยังพูดภาษามนุษย์ได้ จึงโดนตั้งข้อรังเกียจจากเผ่าพันธุ์ของตนทั่งที่เดิมก็โดนรังเกียจที่มีจมูกน้ำเงินอยู่แล้ว เมื่อจะมาอยูกับมนุษย์ก็โดนไล่ยิงเพราะคิดว่าเป็นปีศาจ ต่อมาได้อยู่ร่วมกับมนุษย์ คือหมอกำมะลอ ฮิลรุค (ผู้ที่ร่วมชะตากรรมโดนสังคมรังเกียจเช่นกัน) ฮิลรุคผู้ซึ่งจงรักภักดีต่ออาณาจักรดรัมยิ่งกว่าสิ่งใด ก่อนตัวตายได้ฝากฝังช็อปเปอร์ ไว้กับเพื่อนสนิท ดอกเตอร์ คุเรฮะ ช็อปเปอร์จึงได้รับการถ่ายทอดวิชาการแพทย์ จนสามารถคิดค้นเม็ดยาชนิดพิเศษ 'รัมเบิ้ลบอล' ที่ทำให้พลังของผลปีศาจที่อยู่ในร่างกายปั่นป่วนจนสามารถทำให้แปลงกายได้ถึง 8 ขั้น แต่ในการต่อสู้ไม่ควรกินเกิน2เม็ด เพราะเมื่อกินเม็ดที่2จะเริ่มแปลงร่างไม่ได้ดั่งใจ และเมื่อกินเม็ดที่3จะกลายร่างเป็นอสูรกายร่างยักษ์ขาดสติคลุ้มคลั่ง ค่าหัว 50 เบรี ได้รับฉายาว่า 'ผู้ชื่นชอบขนมหวาน ช็อปเปอร์'"
    },

    {
        id: 7,
        img: require('../image/Lobin.jpg'),
        pic: require('../image/Pic/Luffy_1.png') ,
        ชื่อ: "นิโค โรบิน (ニコ・ロビン Ni co Robin)",
        ค่าหัว: "130,000,000 เบรี",
        ตำแหน่ง: "นักโบราณคดีประจำกลุ่มโจรสลัดหมวกฟาง",
        ความสามารถ: "-",
        ผลปิศาจ: "ผล ฮานะ ฮานะ ผลดอกไม้ ",
        ฉายา: "เทพวิบัติ",
        ความเป็นมา: "สาวนักโบราณคดี ผู้มีชีวิตเหลือรอดคนเดียวจากเกาะแห่งนักประวัติศาสตร์และนักวิชาการ 'โอฮาร่า' มีความสามารถอ่านภาษาโบราณโพเนกลีฟได้ พยายามตามหาโพเนกลีฟที่แท้จริง ตามรอยมารดา นิโค โอลีเวีย ในวัยเด็กโรบินกินผลฮานะฮานะ (พารามิเซีย) เข้าไป ทำให้สามารถแตกหน่ออวัยวะในร่างกายได้ทุกที่ที่โรบินสามารถมองเห็นได้ทำให้ถูกคนอื้นคิดว่าเป็นปีศาจ และทำให้เธอไม่ค่อยมี่เพื่อน ถูกตั้งค่าหัวตั้งแต่อายุ 8 ขวบ ค่าหัว 79 ล้านเบรี ค่าหัวล่าสุด 80 ล้านเบรี ได้รับฉายาว่า 'ลูกปีศาจ นิโคโรบิน'"
    },

    {
        id: 8,
        img: require('../image/Franky.png'),
        pic: require('../image/Pic/Luffy_1.png') ,
        ชื่อ: "แฟรงกี้ ( フランキー Franky)",
        ค่าหัว: "94,000,000 เบรี",
        ตำแหน่ง: "ช่างซ่อมเรือประจำกลุ่มโจรสลัดหมวกฟาง",
        ความสามารถ: "-",
        ผลปิศาจ: "ไม่มี",
        ฉายา: "ไซบอร์กแฟรงกี้",
        ความเป็นมา: "แฟรงกี้ หรืออีกชื่อหนึ่งคือ คัตตี้ แฟงค์ เป็นนักแยกชิ้นส่วนเรือ ผู้ชอบดื่มโคล่าเป็นชีวิตจิตใจ อีกทั้งยังเป็นหัวหน้าพวกแก๊งในเมืองวอเตอร์เซเว่น ในใจลึกๆแล้วแฟรงกี้ทำเพื่อปกป้องเมืองที่ตนรักเท่านั้น แฟรงกี้มีอดีตอันเจ็บปวดที่เกิดกับผู้มีพระคุณของเขา และเนื่องจากเหตุการณ์ในอดีต เพื่อความอยู่รอดเขาจึงต้องดัดแปลงตัวเองไปเป็นไซบอร์ก (ซึ่งจะได้รับพลังงานมาจากโคล่า) เขามีแบบแปลนอาวุธโบราณ 'พลูตัน' ที่รัฐบาลโลกต้องการและได้เผาทำลายไปในเหตุการณ์ที่เกาะเอนิเอสล็อบบี้ก่อนที่จะมาเข้ากลุ่มหมวกฟาง ปัจจุบันเป็นช่างซ่อมเรือประจำกลุ่ม ค่าหัว 44ล้านเบรี ได้รับฉายาว่า 'ไซบอร์ก แฟรงกี้'"
    },

    {
        id: 9,
        img: require('../image/Brook.jpeg'),
        pic: require('../image/Pic/Luffy_1.png') ,
        ชื่อ: "ฮัมมิ่ง บลู๊ค ( ブルック Hamming Brook)",
        ค่าหัว: "83,000,000 เบรี",
        ตำแหน่ง: "นักดนตรีประจำกลุ่มโจรสลัดหมวกฟาง",    
        ความสามารถ: "-",
        ผลปิศาจ: "ผล โยมิ โยมิ ผล คืนชีพ เมื่อตายวิญญาณจะกลับสู่ร่าง",
        ฉายา: "สุภาพบุรุษ บลู๊ค",
        ความเป็นมา: "สมาชิกคนล่าสุดของกลุ่ม กินผลโยมิโยมิ (คืนชีพ) เป็นนักดาบและนักดนตรี บรู๊คเคยสัญญากับลาบูนที่แหลมแฝดไว้ว่า จะวนรอบโลกแล้วกลับมาหาลาบูนอีกครั้งหนึ่ง แต่แล้ววันหนึ่งกลุ่มของเขาก็ต้องพินาศย่อยยับ ก่อนที่จะตายจากกันนั้น เขาและพวกพ้องเล่นดนตรีร่วมกันแล้วบันทึกเสียงไว้ในโทนไดอัล เพื่อเอาไปให้ลาบูนได้ฟังในวันที่เจอกับลาบูนอีกครั้ง เมื่อเวลาผ่านไป50ปี เขามาพบกับกลุ่มของลูฟี่และขอร่วมเดินทางไปด้วย ลักษณะที่สังเกตเห็นได้ชัด คือ มีรูปร่างเป็นโครงกระดูก และมีผมทรงแอพโฟ่ ตอนยังมีชีวิตอยู่ มีค่าหัว 33 ล้านเบรี ได้รับฉายาว่า 'ฮัมมิ่ง บรู๊ค'"
    },

    {
        id: 10,
        img: require('../image/Jinbe.jpg'),
        pic: require('../image/Pic/Luffy_1.png') ,
        ชื่อ: "จินเบย์ – Jinbei ( ジンベエ )",
        ค่าหัว: "438,000,000 เบรี",
        ตำแหน่ง: "ผู้คุมหางเสือ",    
        ความสามารถ: "ว่ายน้ำ",
        ผลปิศาจ: "ไม่มี",
        ฉายา: "ชายชาตรีแห่งท้องทะเล (Knigth of the Sea)",
        ความเป็นมา: "จินเบย์เป็นผู้นำคนที่ 2 รองจาก ไทเกอร์ ฟิชเชอร์ มนุษย์เงือกในตำนาน ฃหลังจากที่รู้ว่า ฟิชเชอร์ ไทเกอร์ช่วยพวกทาสก็รวมกลุ่ม จินเบย์กับโจรสลัดเงือกกลุ่มต่างๆ เข้าร่วมกับไทเกอร์ จนได้เป็นรองกัปตัน แต่ก่อเรื่องตลอด และนับถือฟิชเชอร์ ไทเกอร์มาก จินเบย์รับผิดชอบเป็นกัปตันคนต่อไปจนมีชื่อเสียงและยอมรับเป็นเจ็ดเทพโจรสลัด กับทำตามวิธีในแบบของไทเกอร์ และขอให้รัฐบาลโลกปล่อยอารองตามเงื่อนไข จนกลุ่มอารองกับมาร์โก้แยกตัวแต่ลูฟี่ได้ลอบเข้ามาในคุกอิมเพลดาวน์หวังที่จะช่วยตัวเอสออกไป จินเบย์จึงช่วยลูฟี่แหกคุกอิมเพลดาวน์และได้เข้าร่วมต่อสู้ด้วยในสงคราม จินเบย์พยายามปกป้องลูฟี่จากพลเอกอาคาอินุ เพื่อนำขึ้นเรือแต่ทั้งคู่ก็สาหัส แต่ก็ถูกคร็อกโคไดล์มาช่วยให้หนีไปได้หลังจากจบสงคราม ภายหลังจากนั้นได้ส่งสารให้พรรคพวกลูฟี่ จากนั้นก็ลากับลูฟี่และบอกให้เจอกันอีกใน 2 ปี โดยรอคอยลูฟี่ที่นอกเกาะเงือกเพราะเป็นโจรสลัด พอพวกลูฟี่มา พบฮัจจิก็เล่าเรื่องอดีตของกลุ่มกับอาณาจักรให้ฟัง จินเบย์เข้าร่วมมือกับกลุ่มหมวงฟางเพื่อต่อสู้กับโฮดี้ และถูกลูฟี่ชวนเข้ากลุ่มแต่ปฏิเสธไป"
    },
]